{
    "id": "43edf7d0-5a5a-47d9-9b30-103ceccb361c",
    "name": "Printing Table of Medal Winner Counts with Row and Column Totals",
    "order": 1,
    "language": "JAVA",
    "activityName": "arrays2d.j_print_medals",
    "fileName": "JPrintMedalsRowColumnTotal.java",
    "goalDescription": "Assume that we have an array of countries that stores the names of the seven countries that participated in the Skating competitions at the Winter Olympic. We also have a 7x3 matrix that stores the number of medals that these seven countries won. This matrix looks like as follows:\\n{ {1, 0, 1 },\\n { 1, 1, 0 },\\n ...}\\nThe first, second, and third numbers within a row i represent the number of Gold, Silver, and Bronze medals won by the country that is at the index i of the array of countries.\\nConstruct a program that takes this matrix and the array of countries, and prints a table of medal counts with row and column totals. The column totals are the sum of the gold, silver, and bronze medals won in the competition. The output table should look like as follows:\\n      Country    Gold  Silver  Bronze   Total\\n         Canada        1       0       1          2\\n            China        1       1       0          2\\n           ...\\nColumn Total      4       4       4",
    "correctOutput": "Name  G  S  B All\n CAN  1  0  1  2\n CHN  1  1  0  2\n GER  0  0  1  1\n KOR  1  0  0  1\n JPN  0  1  1  2\n RUS  0  1  1  2\n USA  1  1  0  2\n All  4  4  4",
    "userInputList": [],
    "userInput": "",
    "lineList": [
        {
            "id": "c52af332-9da0-4cdc-9702-e78ed16f2969",
            "number": 6,
            "content": "\t\tint[][] medalCounts = { { 1, 0, 1 }, { 1, 1, 0 }, { 0, 0, 1 }, { 1, 0, 0 }, ",
            "commentList": [
                "We need to create the matrix of medal counts. To do this, we use a two-dimensional array (an array of arrays) where each row corresponds to the gold, silver, and bronze medals won by one country. This statement creates a 7x3 two-dimensional array called medalCounts. Each row of the matrix corresponds to the medal counts for the corresponding country in the array of countries. The first, second, and third numbers within a row represent the number of Gold, Silver, and Bronze medals won by the corresponding country in that row.",
                "Note that arrays can naturally span multiple lines if we want them to because they are contained by braces."
            ],
            "indentLevel": 2
        }
    ],
    "distractorList": [
        {
            "id": "badc44d8-3e91-4c66-92da-84dc08c827e0",
            "line": {
                "id": "7fb16d89-7540-44c0-ab03-b07ebc6d05e6",
                "number": 0,
                "content": "columnTotals[j] += medalCounts[j][i];",
                "commentList": [
                    ""
                ],
                "indentLevel": 0
            },
            "helpList": [
                ""
            ]
        }
    ],
    "blankLineList": [
        {
            "id": "344e95b7-0d07-4ec1-8f64-c536cfb11a02",
            "line": {
                "id": "73f9bcb1-8b6f-4262-89ce-d7ea7f83e948",
                "number": 25,
                "content": "\t\t\t\tcolumnTotals[j] += medalCounts[i][j];",
                "commentList": [
                    "This statement adds the value of the current element in row i and column j to the element in the array columnTotals that stores the column total for the column j in the medalCounts."
                ],
                "indentLevel": 4
            },
            "helpList": [
                "This statement adds the value of the current element in row i and column j to the element in the array columnTotals that stores the column total for the column j in the medalCounts."
            ]
        }
    ],
    "fullyWorkedOut": false
}